[{
    "kind": "Listing",
    "data": {
        "modhash": "m9y8hjbmvidfe6979f774a9b314eaa9e63f26623daa20eaef7",
        "children": [
            {
                "kind": "t3",
                "data": {
                    "contest_mode": false,
                    "banned_by": null,
                    "media_embed": {},
                    "subreddit": "relationships",
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have opinions in here in regards to the deaf community, which I (as a generality) have a low opinion of, mainly due to the way they view deafness. I am not here to argue these positions, although I expect few to disagree with me. If you disagree with these views, please do not respond to this post. I cried a lot when writing this and it is very rambly, so I apologize in advance.&lt;/p&gt;\n\n&lt;p&gt;I am deaf, and I was born deaf. My parents are deaf, and have been their whole lives. They met in high school, where they bonded over being the only other hearing-disabled person they each knew. High school sweetheart type thing. My parents were not able to have children, and they adopted me and my brother. They chose to adopt us because we were deaf; this has never been a hidden fact. &lt;/p&gt;\n\n&lt;p&gt;My parents, and my brother, have a lifestyle issue that has impacted our relationship throughout my entire life. We have a strong disagreement; summed up, they see deafness as a culture/lifestyle, and something to be proud of, and I see it as a curse or disease, and something that doesn&amp;#39;t (or shouldn&amp;#39;t) determine who you are as a person. My parents view is based off a prevalent attitude in the deaf community, which has good intentions (not being ashamed of a disability) but takes it to bad places, as in my situation. My parents believe that efforts to cure or reduce deafness are a form of cultural encroachment. They were involved in an effort to publicly ignore a man from their friend-group because he chose to get the same procedure I received. I have never heard them use this term, but they associate with several people I know use the word &amp;quot;genocide&amp;quot; to describe the hearing disabled receiving procedures like the one I received. My parents and I view the world very differently, and they have felt comfortable brushing off every political and ethical opinion I&amp;#39;ve ever held by dismissing it as me being young. I love them, but they act very poorly in this regard. If you ever heard of the stereotypical judgmental baby boomers, you&amp;#39;ve met my parents. (&amp;quot;Kids these days...&amp;quot;, etc.)&lt;/p&gt;\n\n&lt;p&gt;Long story short, for most of my life, receiving cochlear implants wasn&amp;#39;t realistic, for either financial reasons or pressure from parents. They obviously never attempted to look into it for me or my brother when we were young, which I resent them for. It was expensive, but I was finally at a point where I was able to obtain good insurance that covered it in my country. I hadn&amp;#39;t seen my parents in over a year and a half, during which time I had the surgery done. I did not tell them about it, fearing a strong negative reaction, but not one even close to what I received. &lt;/p&gt;\n\n&lt;p&gt;Before coming home, I wrote them an email expressing what I had done and the reasons I had done it for. My parents didn&amp;#39;t respond (I came just two hours after I sent the email.) When I got home, (wearing the implant, intentionally), they were furious. My mother cried and slapped me. I was there for all of twenty minutes, all of which was spent with them harassing me and treating my like I was a traitor. My brother wouldn&amp;#39;t look at me at all. My father went into my childhood room and broke my old stuff in front of me. He tried ripping the implant off. I pushed him away, and then he physically picked me up and threw me out of the front door (My father is a strong tall man and I am a short petite woman and I&amp;#39;d be lying if this wasn&amp;#39;t an extremely scary moment for me). I am not exaggerating when I say that he threw me; there is a bruise on my hip to prove it. &lt;/p&gt;\n\n&lt;p&gt;I left and received an email from them telling me we would no longer sustain contact. I have never had this type or level of fight with my parents (NEVER physical, ever) so I was ready not to speak to them for a time, but the &amp;quot;issue&amp;quot; lies in that they are completely dependent on me financially. Several years ago I became very lucky and achieved incredible success in an artistic field and I had more money than I knew what to do with, and I was able to let my parents (who are not money smart) retire without straining me. The reason they are still living in my childhood home is because of me. The reason they do not work is because of me. I am 99% sure they do not have money saved up. My father heavily implied in the email he sent that he expects a monthly check to keep coming in.&lt;/p&gt;\n\n&lt;p&gt;My parents are jerks and idiots, but I do not want them to become homeless because of their stupidity. Neither of them have any applicable skills and they will not obtain work that will allow them to meet the lifestyle they expect, and they will never downgrade this lifestyle as they believe they are entitled to it.&lt;/p&gt;\n\n&lt;p&gt;I think my parents are doing a terrible thing, BUT, in their defense, they are likely to be ostracized and shunned from the entirety of their peer group because of my decision. I understand it is easy to throw them under the bus, but please view this situation as if my family were in a cult; because that is truly how I do. (I won&amp;#39;t deny that love and desire of approval is clouding my judgement, but I&amp;#39;m unsure as to how much.) Please advise me. I&amp;#39;m lost.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;tl;dr&lt;/strong&gt;: My parents (and brother) decided to cut contact with me because of my decision to get my hearing fixed. They are 100% financially dependent on me and if I stop giving them money they will be screwed. I don&amp;#39;t know how to handle this.&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "selftext": "I have opinions in here in regards to the deaf community, which I (as a generality) have a low opinion of, mainly due to the way they view deafness. I am not here to argue these positions, although I expect few to disagree with me. If you disagree with these views, please do not respond to this post. I cried a lot when writing this and it is very rambly, so I apologize in advance.\n\nI am deaf, and I was born deaf. My parents are deaf, and have been their whole lives. They met in high school, where they bonded over being the only other hearing-disabled person they each knew. High school sweetheart type thing. My parents were not able to have children, and they adopted me and my brother. They chose to adopt us because we were deaf; this has never been a hidden fact. \n\nMy parents, and my brother, have a lifestyle issue that has impacted our relationship throughout my entire life. We have a strong disagreement; summed up, they see deafness as a culture/lifestyle, and something to be proud of, and I see it as a curse or disease, and something that doesn't (or shouldn't) determine who you are as a person. My parents view is based off a prevalent attitude in the deaf community, which has good intentions (not being ashamed of a disability) but takes it to bad places, as in my situation. My parents believe that efforts to cure or reduce deafness are a form of cultural encroachment. They were involved in an effort to publicly ignore a man from their friend-group because he chose to get the same procedure I received. I have never heard them use this term, but they associate with several people I know use the word \"genocide\" to describe the hearing disabled receiving procedures like the one I received. My parents and I view the world very differently, and they have felt comfortable brushing off every political and ethical opinion I've ever held by dismissing it as me being young. I love them, but they act very poorly in this regard. If you ever heard of the stereotypical judgmental baby boomers, you've met my parents. (\"Kids these days...\", etc.)\n\nLong story short, for most of my life, receiving cochlear implants wasn't realistic, for either financial reasons or pressure from parents. They obviously never attempted to look into it for me or my brother when we were young, which I resent them for. It was expensive, but I was finally at a point where I was able to obtain good insurance that covered it in my country. I hadn't seen my parents in over a year and a half, during which time I had the surgery done. I did not tell them about it, fearing a strong negative reaction, but not one even close to what I received. \n\nBefore coming home, I wrote them an email expressing what I had done and the reasons I had done it for. My parents didn't respond (I came just two hours after I sent the email.) When I got home, (wearing the implant, intentionally), they were furious. My mother cried and slapped me. I was there for all of twenty minutes, all of which was spent with them harassing me and treating my like I was a traitor. My brother wouldn't look at me at all. My father went into my childhood room and broke my old stuff in front of me. He tried ripping the implant off. I pushed him away, and then he physically picked me up and threw me out of the front door (My father is a strong tall man and I am a short petite woman and I'd be lying if this wasn't an extremely scary moment for me). I am not exaggerating when I say that he threw me; there is a bruise on my hip to prove it. \n\nI left and received an email from them telling me we would no longer sustain contact. I have never had this type or level of fight with my parents (NEVER physical, ever) so I was ready not to speak to them for a time, but the \"issue\" lies in that they are completely dependent on me financially. Several years ago I became very lucky and achieved incredible success in an artistic field and I had more money than I knew what to do with, and I was able to let my parents (who are not money smart) retire without straining me. The reason they are still living in my childhood home is because of me. The reason they do not work is because of me. I am 99% sure they do not have money saved up. My father heavily implied in the email he sent that he expects a monthly check to keep coming in.\n\nMy parents are jerks and idiots, but I do not want them to become homeless because of their stupidity. Neither of them have any applicable skills and they will not obtain work that will allow them to meet the lifestyle they expect, and they will never downgrade this lifestyle as they believe they are entitled to it.\n\nI think my parents are doing a terrible thing, BUT, in their defense, they are likely to be ostracized and shunned from the entirety of their peer group because of my decision. I understand it is easy to throw them under the bus, but please view this situation as if my family were in a cult; because that is truly how I do. (I won't deny that love and desire of approval is clouding my judgement, but I'm unsure as to how much.) Please advise me. I'm lost.\n\n---   \n  **tl;dr**: My parents (and brother) decided to cut contact with me because of my decision to get my hearing fixed. They are 100% financially dependent on me and if I stop giving them money they will be screwed. I don't know how to handle this.",
                    "likes": null,
                    "suggested_sort": "confidence",
                    "user_reports": [],
                    "secure_media": null,
                    "link_flair_text": "Non-Romantic",
                    "id": "6a2fvv",
                    "view_count": null,
                    "secure_media_embed": {},
                    "clicked": false,
                    "score": 107,
                    "report_reasons": null,
                    "author": "lendmeanear0",
                    "saved": false,
                    "mod_reports": [],
                    "name": "t3_6a2fvv",
                    "subreddit_name_prefixed": "r/relationships",
                    "approved_by": null,
                    "over_18": false,
                    "domain": "self.relationships",
                    "hidden": false,
                    "thumbnail": "",
                    "subreddit_id": "t5_2qjvn",
                    "edited": 1494294067.0,
                    "link_flair_css_class": "m-gn misc",
                    "author_flair_css_class": null,
                    "gilded": 0,
                    "downs": 0,
                    "brand_safe": true,
                    "archived": false,
                    "removal_reason": null,
                    "can_gild": true,
                    "is_self": true,
                    "hide_score": true,
                    "spoiler": false,
                    "permalink": "/r/relationships/comments/6a2fvv/my_24_f_mother_55_f_father_59_m_and_brother_28_m/",
                    "num_reports": null,
                    "locked": false,
                    "stickied": false,
                    "created": 1494322409.0,
                    "url": "https://www.reddit.com/r/relationships/comments/6a2fvv/my_24_f_mother_55_f_father_59_m_and_brother_28_m/",
                    "author_flair_text": null,
                    "quarantine": false,
                    "title": "My [24 F] mother [55 F], father [59 M] and brother [28 M] have decided to cut contact with me because I chose to obtain bilateral cochlear implants. They are completely financially dependent on me.",
                    "created_utc": 1494293609.0,
                    "distinguished": null,
                    "media": null,
                    "num_comments": 55,
                    "visited": false,
                    "subreddit_type": "public",
                    "ups": 107
                }
            },
            {
                "kind": "t3",
                "data": {
                    "contest_mode": false,
                    "banned_by": null,
                    "media_embed": {},
                    "subreddit": "relationships",
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My dad started dating his girlfriend Cynthia a couple years ago, but I only started getting to know her well in the past year. Cynthia moved in with my dad six months ago, and since I mostly split time between my dad&amp;#39;s house and my mom&amp;#39;s house, I saw her a lot more. I used to like Cynthia a lot more, but the last couple of months she has started acting like she&amp;#39;s my mom, and that she can make rules and decisions for me, and that her opinion is necessary. I think she means well, and I feel a little sorry for her because I know she wanted kids and never got to have any, but she is way over the line, and is getting involved in stuff that is none of her business. I&amp;#39;d be okay with her offering help and advise, but she interferes too much.&lt;/p&gt;\n\n&lt;p&gt;For instance, Cynthia doesn&amp;#39;t like that I don&amp;#39;t visit my grandmother that much, because I can&amp;#39;t stand her (for good reasons). I have a deal with my dad that I only have a see my grandmother for certain special occasions, and other than that I don&amp;#39;t visit. Cynthia keeps telling me that I should see her more often, that I&amp;#39;ll regret not seeing her after she dies, and that I should be more appreciative of family. I don&amp;#39;t know why she cares, it&amp;#39;s not her mother. My dad understands and agreed to this, and it&amp;#39;s none of Cynthia&amp;#39;s business. Sometimes, my dad will ask me to pretend I recently visited my grandmother or called her, just to shut Cynthia up.&lt;/p&gt;\n\n&lt;p&gt;Cynthia also showed up at a meeting my parents had to have with my guidance counselor at school. I didn&amp;#39;t want her there, she&amp;#39;s not even my actual stepmother, and this was for parents only. The counselor told her she couldn&amp;#39;t be there, which really upset her, since she said she wanted to help me. Cynthia tried to argue that she should stay, but the counselor made her wait in the hallway.&lt;/p&gt;\n\n&lt;p&gt;One time more recently where she interfered too much was when I got invited to my school&amp;#39;s prom (I&amp;#39;m a sophomore, so I can only go if I go as someone&amp;#39;s date). My parents were fine with it, but Cynthia said I shouldn&amp;#39;t go, because it would make prom seem not as special when I went, and kept trying to convince my dad I shouldn&amp;#39;t go. Cynthia told me that I would understand when I got to go for my own prom, and would be glad I waited, but I think it&amp;#39;s just a dance. My dad thought Cynthia was wrong but didn&amp;#39;t want to deal with it, so he had me go to my mom&amp;#39;s house the night of the prom, and told me to just not talk about the prom to Cynthia.&lt;/p&gt;\n\n&lt;p&gt;A couple of problems I&amp;#39;m dealing with right now are that Cynthia doesn&amp;#39;t want me to go on a camping trip with some friends because she hasn&amp;#39;t met some of my friends who are going, and she hasn&amp;#39;t met my friends parents who will be there too. My parents know the other family and are fine with them being in charge of the trip, but Cynthia said she wouldn&amp;#39;t be okay with me going unless she got a chance to spend time with the other family first. The other family is busy and didn&amp;#39;t have time to get together with us before the trip, so Cynthia tried to convince my dad that I shouldn&amp;#39;t go. I know she only wants me to be safe, but my parents are fine with me going, so Cynthia&amp;#39;s opinion doesn&amp;#39;t matter.&lt;/p&gt;\n\n&lt;p&gt;Cynthia is also arguing that I should have to go to school on the last day. I already have plans for the last day of school. Almost nobody goes, it&amp;#39;s only for seniors to practice their graduation ceremony and to make up any finals you missed. I skipped it last year, and my parents were fine with that, and my dad was fine with me making other plans until Cynthia started saying that it was setting a bad example to let me skip, even if I wasn&amp;#39;t missing anything. They don&amp;#39;t even take attendance that day! My dad is trying to get me to cancel my plans and go to school to sit around and do nothing, just to make Cynthia happy.&lt;/p&gt;\n\n&lt;p&gt;I hate this because the whole thing with Cynthia is making want to spend less time with my dad. Also, when Cynthia is in a good mood, she&amp;#39;s great, and I liked her before all this stuff started happening, but any time her opinion about me isn&amp;#39;t followed and she&amp;#39;s not treated like a parent, she starts arguing and even cries. My dad doesn&amp;#39;t really help much, usually I end up getting to do what my parents allow, but that&amp;#39;s usually only because he has me go to my mom&amp;#39;s house or sneak around so Cynthia doesn&amp;#39;t find out and he doesn&amp;#39;t have to argue with her. I wish he&amp;#39;d just tell her to stop, because this way she will keep doing it. I don&amp;#39;t know what else to do, Cynthia is fine to be around when everything is okay, but I can&amp;#39;t handle her when she&amp;#39;s upset that she isn&amp;#39;t my mother. Is there anything else I can do?&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;tl;dr&lt;/strong&gt;: My father&amp;#39;s girlfriend tries to be my mom, and my dad isn&amp;#39;t really helping&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "selftext": "My dad started dating his girlfriend Cynthia a couple years ago, but I only started getting to know her well in the past year. Cynthia moved in with my dad six months ago, and since I mostly split time between my dad's house and my mom's house, I saw her a lot more. I used to like Cynthia a lot more, but the last couple of months she has started acting like she's my mom, and that she can make rules and decisions for me, and that her opinion is necessary. I think she means well, and I feel a little sorry for her because I know she wanted kids and never got to have any, but she is way over the line, and is getting involved in stuff that is none of her business. I'd be okay with her offering help and advise, but she interferes too much.\n\nFor instance, Cynthia doesn't like that I don't visit my grandmother that much, because I can't stand her (for good reasons). I have a deal with my dad that I only have a see my grandmother for certain special occasions, and other than that I don't visit. Cynthia keeps telling me that I should see her more often, that I'll regret not seeing her after she dies, and that I should be more appreciative of family. I don't know why she cares, it's not her mother. My dad understands and agreed to this, and it's none of Cynthia's business. Sometimes, my dad will ask me to pretend I recently visited my grandmother or called her, just to shut Cynthia up.\n\nCynthia also showed up at a meeting my parents had to have with my guidance counselor at school. I didn't want her there, she's not even my actual stepmother, and this was for parents only. The counselor told her she couldn't be there, which really upset her, since she said she wanted to help me. Cynthia tried to argue that she should stay, but the counselor made her wait in the hallway.\n\nOne time more recently where she interfered too much was when I got invited to my school's prom (I'm a sophomore, so I can only go if I go as someone's date). My parents were fine with it, but Cynthia said I shouldn't go, because it would make prom seem not as special when I went, and kept trying to convince my dad I shouldn't go. Cynthia told me that I would understand when I got to go for my own prom, and would be glad I waited, but I think it's just a dance. My dad thought Cynthia was wrong but didn't want to deal with it, so he had me go to my mom's house the night of the prom, and told me to just not talk about the prom to Cynthia.\n  \nA couple of problems I'm dealing with right now are that Cynthia doesn't want me to go on a camping trip with some friends because she hasn't met some of my friends who are going, and she hasn't met my friends parents who will be there too. My parents know the other family and are fine with them being in charge of the trip, but Cynthia said she wouldn't be okay with me going unless she got a chance to spend time with the other family first. The other family is busy and didn't have time to get together with us before the trip, so Cynthia tried to convince my dad that I shouldn't go. I know she only wants me to be safe, but my parents are fine with me going, so Cynthia's opinion doesn't matter.\n\nCynthia is also arguing that I should have to go to school on the last day. I already have plans for the last day of school. Almost nobody goes, it's only for seniors to practice their graduation ceremony and to make up any finals you missed. I skipped it last year, and my parents were fine with that, and my dad was fine with me making other plans until Cynthia started saying that it was setting a bad example to let me skip, even if I wasn't missing anything. They don't even take attendance that day! My dad is trying to get me to cancel my plans and go to school to sit around and do nothing, just to make Cynthia happy.\n\nI hate this because the whole thing with Cynthia is making want to spend less time with my dad. Also, when Cynthia is in a good mood, she's great, and I liked her before all this stuff started happening, but any time her opinion about me isn't followed and she's not treated like a parent, she starts arguing and even cries. My dad doesn't really help much, usually I end up getting to do what my parents allow, but that's usually only because he has me go to my mom's house or sneak around so Cynthia doesn't find out and he doesn't have to argue with her. I wish he'd just tell her to stop, because this way she will keep doing it. I don't know what else to do, Cynthia is fine to be around when everything is okay, but I can't handle her when she's upset that she isn't my mother. Is there anything else I can do?\n  ---   \n  **tl;dr**: My father's girlfriend tries to be my mom, and my dad isn't really helping",
                    "likes": null,
                    "suggested_sort": "confidence",
                    "user_reports": [],
                    "secure_media": null,
                    "link_flair_text": "Non-Romantic",
                    "id": "6a0mz0",
                    "view_count": null,
                    "secure_media_embed": {},
                    "clicked": false,
                    "score": 208,
                    "report_reasons": null,
                    "author": "notyamamma",
                    "saved": false,
                    "mod_reports": [],
                    "name": "t3_6a0mz0",
                    "subreddit_name_prefixed": "r/relationships",
                    "approved_by": null,
                    "over_18": false,
                    "domain": "self.relationships",
                    "hidden": false,
                    "thumbnail": "",
                    "subreddit_id": "t5_2qjvn",
                    "edited": false,
                    "link_flair_css_class": "m-gn misc",
                    "author_flair_css_class": null,
                    "gilded": 0,
                    "downs": 0,
                    "brand_safe": true,
                    "archived": false,
                    "removal_reason": null,
                    "can_gild": true,
                    "is_self": true,
                    "hide_score": false,
                    "spoiler": false,
                    "permalink": "/r/relationships/comments/6a0mz0/my_16f_fathers_girlfriend_45f_is_acting_like_shes/",
                    "num_reports": null,
                    "locked": false,
                    "stickied": false,
                    "created": 1494303431.0,
                    "url": "https://www.reddit.com/r/relationships/comments/6a0mz0/my_16f_fathers_girlfriend_45f_is_acting_like_shes/",
                    "author_flair_text": null,
                    "quarantine": false,
                    "title": "My [16F] father's girlfriend [45F] is acting like she's my mom",
                    "created_utc": 1494274631.0,
                    "distinguished": null,
                    "media": null,
                    "num_comments": 38,
                    "visited": false,
                    "subreddit_type": "public",
                    "ups": 208
                }
            },
            {
                "kind": "t3",
                "data": {
                    "contest_mode": false,
                    "banned_by": null,
                    "media_embed": {},
                    "subreddit": "relationships",
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I have had three miscarriages.  My first one was at 12 weeks after having a perfect scan a few weeks beforehand.  It completely caught me off guard and devastated me.  My friend &amp;quot;Hannah&amp;quot; was pregnant with her first child [2/M] at the time of my loss, and coincidentally we were co-planning and throwing a baby shower for another mutual friend, &amp;quot;Barbara&amp;quot;, of ours who was due only a couple months later.  It was an awful time for me, neither of them were there for me during the loss, but I understood and just chalked it up to them being busy with their pregnancies and not understanding pregnancy loss.&lt;/p&gt;\n\n&lt;p&gt;I went on to have two more miscarriages after that.  On my birthday during this time Hannah and Barbara took me out to lunch and talked about their birth stories and parenting the whole time.  I was extremely hurt and it ruined my birthday, but again, I chalked it up to them just not getting it and moved on with my life.  &lt;/p&gt;\n\n&lt;p&gt;Today I am 15 months out from my last loss.  I am in a much better place emotionally.  My husband and I have stopped trying for a baby.  I am an auntie to my best friend&amp;#39;s baby (not Hannah or Barbara) and I generally am okay when it comes to other people having kids and try to be involved with them.  I haven&amp;#39;t really done so with the two of them because Barbara moved across the state and Hannah lives across town and she&amp;#39;s been busy with her son.  I hadn&amp;#39;t heard from Hannah much until around November of last year.&lt;/p&gt;\n\n&lt;p&gt;She asked me to get lunch, during which she dropped the bomb that she&amp;#39;d had a miscarriage.  I was not expecting it at all, and I tried to comfort her, but everything she said either a.) brought back horrible feelings of grief that I had hoped had subsided or b.) was peppered with &amp;quot;at least I have George (her son)&amp;quot;, which was like a punch to the gut.&lt;/p&gt;\n\n&lt;p&gt;She&amp;#39;s an intelligent person, but apparently just really obtuse about how what she&amp;#39;s saying is inappropriate.  I don&amp;#39;t really know.  All I know is that after that lunch I was thrown back into my own grief for a week and I get queasy at the thought of having to speak with her again about any of this.&lt;/p&gt;\n\n&lt;p&gt;I think if it were someone else going through a loss who needed support, it would be different.  I know as well as anyone how important a support system is after a miscarriage, and I feel terrible about not wanting to be there for her, but I just can&amp;#39;t do it.  I do not want to explain to her how she not only did not support me during my losses, but that she made it worse with insensitive remarks about her own pregnancy/parenting, even if it was unwittingly.  I do not want to explain to her how crappy it is to hear her say &amp;quot;at least I have George&amp;quot;.  I just do not want to ever have to see or speak to her again.&lt;/p&gt;\n\n&lt;p&gt;She keeps asking me to get lunch again.  I know she and her husband are still trying for another baby.  I don&amp;#39;t want to be confronted with the possibility that she&amp;#39;s pregnant again and hear her talk about her fears of losing it.  I lost both subsequent pregnancies, so I understand the fear, but mine was confirmed and I don&amp;#39;t have it in me to say b.s. like &amp;quot;it&amp;#39;ll be okay&amp;quot; or anything at all along those lines.&lt;/p&gt;\n\n&lt;p&gt;How do I get her requests to meet with me to stop without getting into it with her?  I really don&amp;#39;t want to talk to her about any of this, I just want her to go away and leave me alone.  If that sounds insensitive, I&amp;#39;m sorry, but it&amp;#39;s how I feel.  I&amp;#39;ve made hundreds of excuses and keep getting the date pushed back but she won&amp;#39;t give up.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;tl;dr&lt;/strong&gt;: Friend had a miscarriage and is looking to me for support, I have had three miscarriages and I don&amp;#39;t want to be there for her after not receiving any support from her during my losses and feeling hurt after insensitive remarks she made while I was grieving.  Don&amp;#39;t want to tell her why I don&amp;#39;t want to see her, I just don&amp;#39;t want to.  How do I bow out without explaining why?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "selftext": "I have had three miscarriages.  My first one was at 12 weeks after having a perfect scan a few weeks beforehand.  It completely caught me off guard and devastated me.  My friend \"Hannah\" was pregnant with her first child [2/M] at the time of my loss, and coincidentally we were co-planning and throwing a baby shower for another mutual friend, \"Barbara\", of ours who was due only a couple months later.  It was an awful time for me, neither of them were there for me during the loss, but I understood and just chalked it up to them being busy with their pregnancies and not understanding pregnancy loss.\n\nI went on to have two more miscarriages after that.  On my birthday during this time Hannah and Barbara took me out to lunch and talked about their birth stories and parenting the whole time.  I was extremely hurt and it ruined my birthday, but again, I chalked it up to them just not getting it and moved on with my life.  \n\nToday I am 15 months out from my last loss.  I am in a much better place emotionally.  My husband and I have stopped trying for a baby.  I am an auntie to my best friend's baby (not Hannah or Barbara) and I generally am okay when it comes to other people having kids and try to be involved with them.  I haven't really done so with the two of them because Barbara moved across the state and Hannah lives across town and she's been busy with her son.  I hadn't heard from Hannah much until around November of last year.\n\nShe asked me to get lunch, during which she dropped the bomb that she'd had a miscarriage.  I was not expecting it at all, and I tried to comfort her, but everything she said either a.) brought back horrible feelings of grief that I had hoped had subsided or b.) was peppered with \"at least I have George (her son)\", which was like a punch to the gut.\n\nShe's an intelligent person, but apparently just really obtuse about how what she's saying is inappropriate.  I don't really know.  All I know is that after that lunch I was thrown back into my own grief for a week and I get queasy at the thought of having to speak with her again about any of this.\n\nI think if it were someone else going through a loss who needed support, it would be different.  I know as well as anyone how important a support system is after a miscarriage, and I feel terrible about not wanting to be there for her, but I just can't do it.  I do not want to explain to her how she not only did not support me during my losses, but that she made it worse with insensitive remarks about her own pregnancy/parenting, even if it was unwittingly.  I do not want to explain to her how crappy it is to hear her say \"at least I have George\".  I just do not want to ever have to see or speak to her again.\n\nShe keeps asking me to get lunch again.  I know she and her husband are still trying for another baby.  I don't want to be confronted with the possibility that she's pregnant again and hear her talk about her fears of losing it.  I lost both subsequent pregnancies, so I understand the fear, but mine was confirmed and I don't have it in me to say b.s. like \"it'll be okay\" or anything at all along those lines.\n\nHow do I get her requests to meet with me to stop without getting into it with her?  I really don't want to talk to her about any of this, I just want her to go away and leave me alone.  If that sounds insensitive, I'm sorry, but it's how I feel.  I've made hundreds of excuses and keep getting the date pushed back but she won't give up.\n\n  \n  ---   \n  **tl;dr**: Friend had a miscarriage and is looking to me for support, I have had three miscarriages and I don't want to be there for her after not receiving any support from her during my losses and feeling hurt after insensitive remarks she made while I was grieving.  Don't want to tell her why I don't want to see her, I just don't want to.  How do I bow out without explaining why?",
                    "likes": null,
                    "suggested_sort": "confidence",
                    "user_reports": [],
                    "secure_media": null,
                    "link_flair_text": "Non-Romantic",
                    "id": "69z38r",
                    "view_count": null,
                    "secure_media_embed": {},
                    "clicked": false,
                    "score": 380,
                    "report_reasons": null,
                    "author": "cagedwisdom8",
                    "saved": false,
                    "mod_reports": [],
                    "name": "t3_69z38r",
                    "subreddit_name_prefixed": "r/relationships",
                    "approved_by": null,
                    "over_18": false,
                    "domain": "self.relationships",
                    "hidden": false,
                    "thumbnail": "",
                    "subreddit_id": "t5_2qjvn",
                    "edited": false,
                    "link_flair_css_class": "m-gn misc",
                    "author_flair_css_class": null,
                    "gilded": 0,
                    "downs": 0,
                    "brand_safe": true,
                    "archived": false,
                    "removal_reason": null,
                    "can_gild": true,
                    "is_self": true,
                    "hide_score": false,
                    "spoiler": false,
                    "permalink": "/r/relationships/comments/69z38r/i_32f_dont_want_to_support_friend_34f_who_needs/",
                    "num_reports": null,
                    "locked": false,
                    "stickied": false,
                    "created": 1494289023.0,
                    "url": "https://www.reddit.com/r/relationships/comments/69z38r/i_32f_dont_want_to_support_friend_34f_who_needs/",
                    "author_flair_text": null,
                    "quarantine": false,
                    "title": "I [32/F] don't want to support friend [34/F] who needs support after miscarriage.",
                    "created_utc": 1494260223.0,
                    "distinguished": null,
                    "media": null,
                    "num_comments": 125,
                    "visited": false,
                    "subreddit_type": "public",
                    "ups": 380
                }
            },
            {
                "kind": "t3",
                "data": {
                    "contest_mode": false,
                    "banned_by": null,
                    "media_embed": {},
                    "subreddit": "relationships",
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Hello. I don&amp;#39;t know why I am even writing on here since I doubt you will tell me something different than what friends I&amp;#39;ve talked with already told me, but here goes nothing. This can be a bit long, so I am sorry for this.&lt;/p&gt;\n\n&lt;p&gt;10 years ago I lost my best friend, the woman I grew up with, fell in love and started a family. Kate and I started dating in high school and we married shortly before graduating from university. She became pregnant not shortly after that. I thought I had everything in life, a family that I love and can count on, a devoted and loving wife that I could spend not one but two lives with, I was working my dream job and I thought that nothing could go wrong.&lt;/p&gt;\n\n&lt;p&gt;But I guess life is funny that way. When you think you&amp;#39;re on top, it finds a way to bring you down quickly. And it did in a brutal fashion. Kat passed away due to complications while giving birth to our twin daughters. I&amp;#39;ve never felt emptier and more devastated than that time. I was a complete mess, I don&amp;#39;t think I&amp;#39;ve uttered a single word to anyone for a whole year. It all seemed hopeless, I had lost all will to live and I was in a really bad place mentally.  &lt;/p&gt;\n\n&lt;p&gt;But because of my family and especially, because of my girls, I sought out help. I started attending various support groups, talked with professionals and I even started going out with friends again. I slowly adjusted myself to my situations. My wife was gone and she wasn&amp;#39;t coming back and my pain was unbearable. &lt;/p&gt;\n\n&lt;p&gt;But that didn&amp;#39;t mean everyone around me has to suffer because of mе. So I started working on myself and I started fresh. I moved out, settled in a nice town not too far away from where the rest of my family reside and for most of the time, it was just and my girls. &lt;/p&gt;\n\n&lt;p&gt;Until I ran into Millie. I knew Millie from my university days. She and Kate were friends in fact. They met in classes and remained friends after that. She, of course, knew that Kate passed away but she couldn&amp;#39;t attend her funeral. We started talking to one another, we went out on a few coffee dates and things took off from there. &lt;/p&gt;\n\n&lt;p&gt;She was single at the time, so one day I asked her out on a proper date, she agreed and the rest, as they say, is history. We&amp;#39;ve been together for the last 4 years and I married Millie last year. She has been an absolute gold in these past years, she was very patient and understanding with me and most importantly, she was also really patient with the girls. &lt;/p&gt;\n\n&lt;p&gt;Millie was(is) actually pretty amazing with them and my girls adore her. My family loved her since the first time I introduced her to them and I can honestly say, I think I&amp;#39;ve lucked out again. Millie is such a great person to be around, she is the type of a person to give out good and positive vibes from just being around her, always smiling and always happy. I love this woman with all of my heart and I can&amp;#39;t thank her enough for what she has done for me. &lt;/p&gt;\n\n&lt;p&gt;But now you wonder, if everything is great, why are you on here? Well, the thing is that I don&amp;#39;t even know why I feel like this right now and I feel like a worthless human being. You see, Millie is currently pregnant with our child. It&amp;#39;s a boy and the due date is sometimes in June. And as fate would have it, the 10th anniversary of Kate&amp;#39;s death is also in June. &lt;/p&gt;\n\n&lt;p&gt;And now instead of mourning the loss of my wife, the mother of my children and the loss of my old family, I am gonna be celebrating my new one and the addition of a new member in it. I feel so miserable that instead of grief and pain, I feel joy, I feel love and happiness. Also, there is the fact that I married Millie, my late wife&amp;#39;s friend. I never really gave it too much thought but now I feel like a horrible husband who disrespected his late wife&amp;#39;s memory. I feel like I&amp;#39;ve cheated on her and it sucks, it sucks so fucking much. &lt;/p&gt;\n\n&lt;p&gt;I know that this whole thing is irrational and that none of this is true but yet, the nagging feeling that I did something very wrong is still there. That maybe I had moved on too quickly, that maybe I shouldn&amp;#39;t have moved out and I shouldn&amp;#39;t have started dating Millie. I know that this is something I should discuss with my wife, especially since she knows that something is up with me but I don&amp;#39;t know how to open up this discussion with her. I don&amp;#39;t want to upset her with my problems, especially since she is pregnant and I don&amp;#39;t want to cause her additional stress. But I know that if I keep this hidden away, I wouldn&amp;#39;t be able to deal with it properly and it could get worse in the long run. So what do you think, should I talk with my wife about this or go back to therapy as most of my friends suggested? &lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;tl;dr 10 years ago, I lost my wife Kate who died while giving birth to our twin daughters. I was devastated and was a complete mess because of this but I started working on bettering myself because of my family and my girls. I moved out from town and moved in a new one. There I met Millie, my late wife&amp;#39;s friend, we started spending time together and after some time, we started dating. We got married last year and everything is more than perfect for us. Millie is pregnant with our son and she is due in June, when is the 10th anniversary of Kate&amp;#39;s passing. I feel miserable that instead of grief and pain, I feel joy and happiness. I also feel like I&amp;#39;ve disrespected Kate&amp;#39;s memory by marriyng her friend and starting a family with her and I don&amp;#39;t know If I should bother Millie with my issues or just deal privately with them?&lt;/strong&gt;&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "selftext": "Hello. I don't know why I am even writing on here since I doubt you will tell me something different than what friends I've talked with already told me, but here goes nothing. This can be a bit long, so I am sorry for this.\n\n10 years ago I lost my best friend, the woman I grew up with, fell in love and started a family. Kate and I started dating in high school and we married shortly before graduating from university. She became pregnant not shortly after that. I thought I had everything in life, a family that I love and can count on, a devoted and loving wife that I could spend not one but two lives with, I was working my dream job and I thought that nothing could go wrong.\n\nBut I guess life is funny that way. When you think you're on top, it finds a way to bring you down quickly. And it did in a brutal fashion. Kat passed away due to complications while giving birth to our twin daughters. I've never felt emptier and more devastated than that time. I was a complete mess, I don't think I've uttered a single word to anyone for a whole year. It all seemed hopeless, I had lost all will to live and I was in a really bad place mentally.  \n\nBut because of my family and especially, because of my girls, I sought out help. I started attending various support groups, talked with professionals and I even started going out with friends again. I slowly adjusted myself to my situations. My wife was gone and she wasn't coming back and my pain was unbearable. \n\nBut that didn't mean everyone around me has to suffer because of mе. So I started working on myself and I started fresh. I moved out, settled in a nice town not too far away from where the rest of my family reside and for most of the time, it was just and my girls. \n\nUntil I ran into Millie. I knew Millie from my university days. She and Kate were friends in fact. They met in classes and remained friends after that. She, of course, knew that Kate passed away but she couldn't attend her funeral. We started talking to one another, we went out on a few coffee dates and things took off from there. \n\nShe was single at the time, so one day I asked her out on a proper date, she agreed and the rest, as they say, is history. We've been together for the last 4 years and I married Millie last year. She has been an absolute gold in these past years, she was very patient and understanding with me and most importantly, she was also really patient with the girls. \n\nMillie was(is) actually pretty amazing with them and my girls adore her. My family loved her since the first time I introduced her to them and I can honestly say, I think I've lucked out again. Millie is such a great person to be around, she is the type of a person to give out good and positive vibes from just being around her, always smiling and always happy. I love this woman with all of my heart and I can't thank her enough for what she has done for me. \n\nBut now you wonder, if everything is great, why are you on here? Well, the thing is that I don't even know why I feel like this right now and I feel like a worthless human being. You see, Millie is currently pregnant with our child. It's a boy and the due date is sometimes in June. And as fate would have it, the 10th anniversary of Kate's death is also in June. \n\nAnd now instead of mourning the loss of my wife, the mother of my children and the loss of my old family, I am gonna be celebrating my new one and the addition of a new member in it. I feel so miserable that instead of grief and pain, I feel joy, I feel love and happiness. Also, there is the fact that I married Millie, my late wife's friend. I never really gave it too much thought but now I feel like a horrible husband who disrespected his late wife's memory. I feel like I've cheated on her and it sucks, it sucks so fucking much. \n\nI know that this whole thing is irrational and that none of this is true but yet, the nagging feeling that I did something very wrong is still there. That maybe I had moved on too quickly, that maybe I shouldn't have moved out and I shouldn't have started dating Millie. I know that this is something I should discuss with my wife, especially since she knows that something is up with me but I don't know how to open up this discussion with her. I don't want to upset her with my problems, especially since she is pregnant and I don't want to cause her additional stress. But I know that if I keep this hidden away, I wouldn't be able to deal with it properly and it could get worse in the long run. So what do you think, should I talk with my wife about this or go back to therapy as most of my friends suggested? \n\n\n**tl;dr 10 years ago, I lost my wife Kate who died while giving birth to our twin daughters. I was devastated and was a complete mess because of this but I started working on bettering myself because of my family and my girls. I moved out from town and moved in a new one. There I met Millie, my late wife's friend, we started spending time together and after some time, we started dating. We got married last year and everything is more than perfect for us. Millie is pregnant with our son and she is due in June, when is the 10th anniversary of Kate's passing. I feel miserable that instead of grief and pain, I feel joy and happiness. I also feel like I've disrespected Kate's memory by marriyng her friend and starting a family with her and I don't know If I should bother Millie with my issues or just deal privately with them?**\n\n\n\n\n",
                    "likes": null,
                    "suggested_sort": "confidence",
                    "user_reports": [],
                    "secure_media": null,
                    "link_flair_text": "Personal issues",
                    "id": "69zqlt",
                    "view_count": null,
                    "secure_media_embed": {},
                    "clicked": false,
                    "score": 233,
                    "report_reasons": null,
                    "author": "deskock",
                    "saved": false,
                    "mod_reports": [],
                    "name": "t3_69zqlt",
                    "subreddit_name_prefixed": "r/relationships",
                    "approved_by": null,
                    "over_18": false,
                    "domain": "self.relationships",
                    "hidden": false,
                    "thumbnail": "",
                    "subreddit_id": "t5_2qjvn",
                    "edited": false,
                    "link_flair_css_class": "m-io personal",
                    "author_flair_css_class": null,
                    "gilded": 0,
                    "downs": 0,
                    "brand_safe": true,
                    "archived": false,
                    "removal_reason": null,
                    "can_gild": true,
                    "is_self": true,
                    "hide_score": false,
                    "spoiler": false,
                    "permalink": "/r/relationships/comments/69zqlt/with_the_anniversary_of_my35m_wifes_passing/",
                    "num_reports": null,
                    "locked": false,
                    "stickied": false,
                    "created": 1494295041.0,
                    "url": "https://www.reddit.com/r/relationships/comments/69zqlt/with_the_anniversary_of_my35m_wifes_passing/",
                    "author_flair_text": null,
                    "quarantine": false,
                    "title": "With the anniversary of my[35M] wife's passing upcoming, I don't know what to do with my conflicted feelings about her and my current wife[34F]. I don't know how to navigate all of that and I need help.",
                    "created_utc": 1494266241.0,
                    "distinguished": null,
                    "media": null,
                    "num_comments": 46,
                    "visited": false,
                    "subreddit_type": "public",
                    "ups": 233
                }
            },
            {
                "kind": "t3",
                "data": {
                    "contest_mode": false,
                    "banned_by": null,
                    "media_embed": {},
                    "subreddit": "relationships",
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;My parents pretty much gave me away immediately after being born. I was raised by my grandma (mother’s mom). They gave me up pretty much because my skin tone is dark. For some context – I’m from South Africa, but I live in the States. My dad is white, and my mom is mixed (but she’s very pale and she passes off as white).&lt;/p&gt;\n\n&lt;p&gt;My parents got together during Apartheid in South Africa. They lied to other people that my mom was white. That lie was blown wide open the moment I was born, as my skin tone indicated to the truth of my mother’s genetic background. In order to hide the social shame, they gave me away to my grandma (the best woman Planet Earth has ever seen). She raised me and I consider her as both my dad and my mom.&lt;/p&gt;\n\n&lt;p&gt;After me, my parents had two other children – my younger brothers. They have ivory skin and pass off as white to the casual observer, so my parents kept them. Needless to say, my relationship with my parents and brothers is pretty much non-existent. They would come visit me on the farm with my grandma and uncle from time to time, but they were always like strangers to me. I used to hate their visits not only because it was very awkward to be around them, but also because I felt ashamed in their presence. Growing up I had an endless list of mental and emotional issues stemming from my situation – from despising my skin tone to have zero self-esteem. &lt;/p&gt;\n\n&lt;p&gt;As an adult, I’ve put those issues behind me now. I’m very happy with life these days. I live in the States now, but last month I was back in SA (my uncle died). I met my parents at the funeral and afterwards my mother pulled me aside. She started crying and she apologized for everything that happened. She said if she had the chance to do it all over again, she would have never given me up. She would’ve kept me. My dad eventually joined us and also apologized to me. &lt;/p&gt;\n\n&lt;p&gt;I was numb to be honest. It took me a few days to really process what happened and when I did, I felt a wave of anger and resent. Despite my grandmother being such a wonderful person, when I was a kid, deep down I really did wish my parents said, “fuck what society thinks, that’s our son.” &lt;/p&gt;\n\n&lt;p&gt;During Apartheid, other interracial parents faced the exact same problem and they didn&amp;#39;t back down, no matter what the social or legal ramifications were. I was 5 years old when Apartheid ended and they still did nothing after it. My own brothers are complete strangers to me.&lt;/p&gt;\n\n&lt;p&gt;&lt;strong&gt;tl;dr&lt;/strong&gt; &lt;/p&gt;\n\n&lt;p&gt;But then there is part of me that thinks reconciliation may be the best way forward. I know we’ll never be a “normal family,” but I feel like perhaps establishing some kind of relationship will help all parties involved. I’m expecting a baby in August, and part of me thinks it would be good for my child to know where she’s from. I know this is the internet, and I know everyone who reads and comments on this thread is a stranger to me, but I’d appreciate any advice on the subject. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "selftext": "My parents pretty much gave me away immediately after being born. I was raised by my grandma (mother’s mom). They gave me up pretty much because my skin tone is dark. For some context – I’m from South Africa, but I live in the States. My dad is white, and my mom is mixed (but she’s very pale and she passes off as white).\n\nMy parents got together during Apartheid in South Africa. They lied to other people that my mom was white. That lie was blown wide open the moment I was born, as my skin tone indicated to the truth of my mother’s genetic background. In order to hide the social shame, they gave me away to my grandma (the best woman Planet Earth has ever seen). She raised me and I consider her as both my dad and my mom.\n\nAfter me, my parents had two other children – my younger brothers. They have ivory skin and pass off as white to the casual observer, so my parents kept them. Needless to say, my relationship with my parents and brothers is pretty much non-existent. They would come visit me on the farm with my grandma and uncle from time to time, but they were always like strangers to me. I used to hate their visits not only because it was very awkward to be around them, but also because I felt ashamed in their presence. Growing up I had an endless list of mental and emotional issues stemming from my situation – from despising my skin tone to have zero self-esteem. \n\nAs an adult, I’ve put those issues behind me now. I’m very happy with life these days. I live in the States now, but last month I was back in SA (my uncle died). I met my parents at the funeral and afterwards my mother pulled me aside. She started crying and she apologized for everything that happened. She said if she had the chance to do it all over again, she would have never given me up. She would’ve kept me. My dad eventually joined us and also apologized to me. \n\nI was numb to be honest. It took me a few days to really process what happened and when I did, I felt a wave of anger and resent. Despite my grandmother being such a wonderful person, when I was a kid, deep down I really did wish my parents said, “fuck what society thinks, that’s our son.” \n\nDuring Apartheid, other interracial parents faced the exact same problem and they didn't back down, no matter what the social or legal ramifications were. I was 5 years old when Apartheid ended and they still did nothing after it. My own brothers are complete strangers to me.\n\n**tl;dr** \n\nBut then there is part of me that thinks reconciliation may be the best way forward. I know we’ll never be a “normal family,” but I feel like perhaps establishing some kind of relationship will help all parties involved. I’m expecting a baby in August, and part of me thinks it would be good for my child to know where she’s from. I know this is the internet, and I know everyone who reads and comments on this thread is a stranger to me, but I’d appreciate any advice on the subject. \n\n",
                    "likes": null,
                    "suggested_sort": "confidence",
                    "user_reports": [],
                    "secure_media": null,
                    "link_flair_text": "Non-Romantic",
                    "id": "6a28c1",
                    "view_count": null,
                    "secure_media_embed": {},
                    "clicked": false,
                    "score": 40,
                    "report_reasons": null,
                    "author": "themackman1",
                    "saved": false,
                    "mod_reports": [],
                    "name": "t3_6a28c1",
                    "subreddit_name_prefixed": "r/relationships",
                    "approved_by": null,
                    "over_18": false,
                    "domain": "self.relationships",
                    "hidden": false,
                    "thumbnail": "",
                    "subreddit_id": "t5_2qjvn",
                    "edited": false,
                    "link_flair_css_class": "m-gn misc",
                    "author_flair_css_class": null,
                    "gilded": 0,
                    "downs": 0,
                    "brand_safe": true,
                    "archived": false,
                    "removal_reason": null,
                    "can_gild": true,
                    "is_self": true,
                    "hide_score": false,
                    "spoiler": false,
                    "permalink": "/r/relationships/comments/6a28c1/i_m_26_dont_whether_i_should_forgive_my_parents_m/",
                    "num_reports": null,
                    "locked": false,
                    "stickied": false,
                    "created": 1494320043.0,
                    "url": "https://www.reddit.com/r/relationships/comments/6a28c1/i_m_26_dont_whether_i_should_forgive_my_parents_m/",
                    "author_flair_text": null,
                    "quarantine": false,
                    "title": "I [M 26] don't whether I should forgive my parents [M 51/ F 49] after they gave me away",
                    "created_utc": 1494291243.0,
                    "distinguished": null,
                    "media": null,
                    "num_comments": 18,
                    "visited": false,
                    "subreddit_type": "public",
                    "ups": 40
                }
            },
            {
                "kind": "t3",
                "data": {
                    "contest_mode": false,
                    "banned_by": null,
                    "media_embed": {},
                    "subreddit": "relationships",
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;This is my first time posting, so bear with me. Also yes, I realize I am an adult and technically she can&amp;#39;t force me to do anything, but it&amp;#39;s a little more complicated then that.&lt;/p&gt;\n\n&lt;p&gt;I currently work full time at a elementary school. In the two summers past I have worked at a summer camp, and it is a job I love. However, it is very physically demanding, and I was just diagnosed with a Chondromalacia patellae. &lt;/p&gt;\n\n&lt;p&gt;Basically my knee is incredibly weak (I am in daily chronic pain because of it). I have been realizing that I really can&amp;#39;t work at camp again this year due to needing physical therapy for most of the summer. &lt;/p&gt;\n\n&lt;p&gt;My mom absolutely refuses to believe that I can&amp;#39;t go. The doctor told her that it wasn&amp;#39;t impossible but strongly suggested against it. My case of Chondromalacia patellae is pretty severe and it will take a few months to heal. My mom says that it won&amp;#39;t get more damaged than it already is if I don&amp;#39;t go, which just sounds crazy to me.&lt;/p&gt;\n\n&lt;p&gt;I am going back to school (for a graduate program) in the fall and I want to take care of this before then. I feel like I&amp;#39;m talking to a wall when I tell her I can&amp;#39;t go. She just shuts down the conversation. This camp is out of state so it&amp;#39;s not as though I can use my insurance at a doctors office up there.&lt;/p&gt;\n\n&lt;p&gt;I still live at home but pay rent and bills. Does anybody have any ideas on how I can convince her? Or at least have a better conversation? I plan to find a part time job for the summer.&lt;/p&gt;\n\n&lt;p&gt;tl;dr: I need physical therapy throughout the summer and my mom refuses to believe I can&amp;#39;t go back to work in at a physically demanding summer camp. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "selftext": "This is my first time posting, so bear with me. Also yes, I realize I am an adult and technically she can't force me to do anything, but it's a little more complicated then that.\n\nI currently work full time at a elementary school. In the two summers past I have worked at a summer camp, and it is a job I love. However, it is very physically demanding, and I was just diagnosed with a Chondromalacia patellae. \n\nBasically my knee is incredibly weak (I am in daily chronic pain because of it). I have been realizing that I really can't work at camp again this year due to needing physical therapy for most of the summer. \n\nMy mom absolutely refuses to believe that I can't go. The doctor told her that it wasn't impossible but strongly suggested against it. My case of Chondromalacia patellae is pretty severe and it will take a few months to heal. My mom says that it won't get more damaged than it already is if I don't go, which just sounds crazy to me.\n\nI am going back to school (for a graduate program) in the fall and I want to take care of this before then. I feel like I'm talking to a wall when I tell her I can't go. She just shuts down the conversation. This camp is out of state so it's not as though I can use my insurance at a doctors office up there.\n\nI still live at home but pay rent and bills. Does anybody have any ideas on how I can convince her? Or at least have a better conversation? I plan to find a part time job for the summer.\n\ntl;dr: I need physical therapy throughout the summer and my mom refuses to believe I can't go back to work in at a physically demanding summer camp. ",
                    "likes": null,
                    "suggested_sort": "confidence",
                    "user_reports": [],
                    "secure_media": null,
                    "link_flair_text": "Non-Romantic",
                    "id": "6a11wk",
                    "view_count": null,
                    "secure_media_embed": {},
                    "clicked": false,
                    "score": 79,
                    "report_reasons": null,
                    "author": "should_be_writing1",
                    "saved": false,
                    "mod_reports": [],
                    "name": "t3_6a11wk",
                    "subreddit_name_prefixed": "r/relationships",
                    "approved_by": null,
                    "over_18": false,
                    "domain": "self.relationships",
                    "hidden": false,
                    "thumbnail": "",
                    "subreddit_id": "t5_2qjvn",
                    "edited": false,
                    "link_flair_css_class": "m-gn misc",
                    "author_flair_css_class": null,
                    "gilded": 0,
                    "downs": 0,
                    "brand_safe": true,
                    "archived": false,
                    "removal_reason": null,
                    "can_gild": true,
                    "is_self": true,
                    "hide_score": false,
                    "spoiler": false,
                    "permalink": "/r/relationships/comments/6a11wk/my_mom_f50_is_forcing_me_f23_to_go_against/",
                    "num_reports": null,
                    "locked": false,
                    "stickied": false,
                    "created": 1494307407.0,
                    "url": "https://www.reddit.com/r/relationships/comments/6a11wk/my_mom_f50_is_forcing_me_f23_to_go_against/",
                    "author_flair_text": null,
                    "quarantine": false,
                    "title": "My mom (F/50) is forcing me (F/23) to go against doctors orders. How can I convince her I know what's best?",
                    "created_utc": 1494278607.0,
                    "distinguished": null,
                    "media": null,
                    "num_comments": 22,
                    "visited": false,
                    "subreddit_type": "public",
                    "ups": 79
                }
            },
            {
                "kind": "t3",
                "data": {
                    "contest_mode": false,
                    "banned_by": null,
                    "media_embed": {},
                    "subreddit": "relationships",
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Never thought I&amp;#39;d be posting here, so I appreciate any help from the community.  I&amp;#39;ve been married for 8 years and we have 3 kids together.  Overall its been great, with the occasional rocky spot that we work through.&lt;/p&gt;\n\n&lt;p&gt;Just recently she came clean about a relationship she&amp;#39;d been having with a family friend.  Not a friend we see every week, but one we hang out with a few times a year.  She said it started a year ago as just venting to each other about life, but it turned out they had a lot in common and would decide to meet after work for under the ruse of &amp;#39;grabbing drinks with co-workers.&amp;#39;  I&amp;#39;m not an idiot and when this would happen, I would question her in a not-so-subtle &amp;#39;I wish I had co-workers who went out for drinks on Tuesday&amp;#39;s till 8pm.&amp;#39;  She would always get mad at me for questioning her trust, turning me into the bad-guy.  &lt;/p&gt;\n\n&lt;p&gt;Fast forward to this past week when they had their final meet up and decided the would end it and just never tell their spouses.  Thankfully, but painfully, my wife decided to tell me.  She has been ultra-apologetic about it saying that she knew the whole time that it wasn&amp;#39;t right, and I honestly believe her.  She loves me and our kids and wants to do anything she can to make it right.  &lt;/p&gt;\n\n&lt;p&gt;I&amp;#39;m an absolute mess right now and signing up for a therapist as soon as I can. Can&amp;#39;t sleep; non stop thinking about what may or may not have happened; examining ever second thought I had in the past year about what was happening.  I&amp;#39;m sure these are pretty standard, but it&amp;#39;s affecting me pretty hard.  Went for a 4 mile walk at midnight to see if that would help clear my mind, but it didn&amp;#39;t.&lt;/p&gt;\n\n&lt;p&gt;But, back to the original questions.  Since they are friends of ours, I know the wife well.  I really don&amp;#39;t like that their &amp;#39;pact&amp;#39; gives them the ability to start it up again if they wanted to.  He doesn&amp;#39;t know that I know and part of me really wants to just text her something like &amp;quot;ask your husband about XXXXXX.&amp;quot;  Is that my place?  Should I let him get away with it and have the ability to reach back out to my wife not knowing that I know? &lt;/p&gt;\n\n&lt;p&gt;And my wife keeps asking what she can do to earn back my trust.  At this point, my head isn&amp;#39;t right still, so I don&amp;#39;t really know.  Would getting those apps that allow you to &amp;#39;check in&amp;#39; where the other phone is at be too intrusive?  It seems like it, but if another &amp;#39;drinks after work&amp;#39; situation happened, I could know where she&amp;#39;s at.&lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;tl;dr: Wife cheated on me with a family friend for over a year. She tells me, but he doesn&amp;#39;t tell his wife.  We&amp;#39;re going to try and work it out, but I feel like there&amp;#39;s a loophole with him not telling his wife.  Can I tell the wife or have my wife tell her?  And what can I do to help gain trust in my wife?&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "selftext": "Never thought I'd be posting here, so I appreciate any help from the community.  I've been married for 8 years and we have 3 kids together.  Overall its been great, with the occasional rocky spot that we work through.\n\nJust recently she came clean about a relationship she'd been having with a family friend.  Not a friend we see every week, but one we hang out with a few times a year.  She said it started a year ago as just venting to each other about life, but it turned out they had a lot in common and would decide to meet after work for under the ruse of 'grabbing drinks with co-workers.'  I'm not an idiot and when this would happen, I would question her in a not-so-subtle 'I wish I had co-workers who went out for drinks on Tuesday's till 8pm.'  She would always get mad at me for questioning her trust, turning me into the bad-guy.  \n\nFast forward to this past week when they had their final meet up and decided the would end it and just never tell their spouses.  Thankfully, but painfully, my wife decided to tell me.  She has been ultra-apologetic about it saying that she knew the whole time that it wasn't right, and I honestly believe her.  She loves me and our kids and wants to do anything she can to make it right.  \n\nI'm an absolute mess right now and signing up for a therapist as soon as I can. Can't sleep; non stop thinking about what may or may not have happened; examining ever second thought I had in the past year about what was happening.  I'm sure these are pretty standard, but it's affecting me pretty hard.  Went for a 4 mile walk at midnight to see if that would help clear my mind, but it didn't.\n\nBut, back to the original questions.  Since they are friends of ours, I know the wife well.  I really don't like that their 'pact' gives them the ability to start it up again if they wanted to.  He doesn't know that I know and part of me really wants to just text her something like \"ask your husband about XXXXXX.\"  Is that my place?  Should I let him get away with it and have the ability to reach back out to my wife not knowing that I know? \n\nAnd my wife keeps asking what she can do to earn back my trust.  At this point, my head isn't right still, so I don't really know.  Would getting those apps that allow you to 'check in' where the other phone is at be too intrusive?  It seems like it, but if another 'drinks after work' situation happened, I could know where she's at.\n\n  ---   \n tl;dr: Wife cheated on me with a family friend for over a year. She tells me, but he doesn't tell his wife.  We're going to try and work it out, but I feel like there's a loophole with him not telling his wife.  Can I tell the wife or have my wife tell her?  And what can I do to help gain trust in my wife?",
                    "likes": null,
                    "suggested_sort": "confidence",
                    "user_reports": [],
                    "secure_media": null,
                    "link_flair_text": "Infidelity",
                    "id": "6a036m",
                    "view_count": null,
                    "secure_media_embed": {},
                    "clicked": false,
                    "score": 124,
                    "report_reasons": null,
                    "author": "TheThrowaway_Banana",
                    "saved": false,
                    "mod_reports": [],
                    "name": "t3_6a036m",
                    "subreddit_name_prefixed": "r/relationships",
                    "approved_by": null,
                    "over_18": false,
                    "domain": "self.relationships",
                    "hidden": false,
                    "thumbnail": "",
                    "subreddit_id": "t5_2qjvn",
                    "edited": false,
                    "link_flair_css_class": "m-oe infidelity",
                    "author_flair_css_class": null,
                    "gilded": 0,
                    "downs": 0,
                    "brand_safe": true,
                    "archived": false,
                    "removal_reason": null,
                    "can_gild": true,
                    "is_self": true,
                    "hide_score": false,
                    "spoiler": false,
                    "permalink": "/r/relationships/comments/6a036m/my_37_m_wife34_f_cheated_on_me_for_over_a_year/",
                    "num_reports": null,
                    "locked": false,
                    "stickied": false,
                    "created": 1494298284.0,
                    "url": "https://www.reddit.com/r/relationships/comments/6a036m/my_37_m_wife34_f_cheated_on_me_for_over_a_year/",
                    "author_flair_text": null,
                    "quarantine": false,
                    "title": "My [37 M] wife[34 F] cheated on me for over a year with a friend of the family and just came clean after she ended the affair. Should I tell the other spouse and what can my wife do to earn back my trust?",
                    "created_utc": 1494269484.0,
                    "distinguished": null,
                    "media": null,
                    "num_comments": 105,
                    "visited": false,
                    "subreddit_type": "public",
                    "ups": 124
                }
            },
            {
                "kind": "t3",
                "data": {
                    "contest_mode": false,
                    "banned_by": null,
                    "media_embed": {},
                    "subreddit": "relationships",
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;At the start of the year my girlfriend [30F] had a sore knee. This has slowly progressed in severity until she &amp;quot;feels like her legs are dying&amp;quot; and now she&amp;#39;s all but bedbound and can barely walk. She&amp;#39;s seen multiple doctors, had MRI and X-Rays and nobody can work out what&amp;#39;s wrong with her other than prescribing pain relief. Naturally, we&amp;#39;re both terrified - we were running half marathons together this time last year.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s obviously had a big hit on our relationship. We used to be out most nights of the week and busy socializing on weekends, now we spend most of our time in her bed watching Netflix. Even this is painful for her and most of the time she&amp;#39;s grimacing, groaning and screaming in pain, which is really upsetting to see.&lt;/p&gt;\n\n&lt;p&gt;It&amp;#39;s also really changed the dynamics of our relationship as she&amp;#39;s now almost entirely reliant on me. I&amp;#39;m cleaning her flat, cooking for her, doing her laundry, shopping, assisting her in walking, taking her to clinics and hospitals and so on. Now she&amp;#39;s suggested that I move in with her as she might need my help full time.&lt;/p&gt;\n\n&lt;p&gt;I really love her, but this dependence is sucking the love out of our relationship and slowly grinding me down (any intimacy has dried up as she&amp;#39;s so sensitive to pain I can&amp;#39;t even cuddle her properly). The pain makes her snap at me, and I get frustrated and snap back at her. It&amp;#39;s gotten to the pain where I&amp;#39;m HUGELY relieved when I get to leave her flat. Now she&amp;#39;s talking about me moving in as &amp;quot;I might need your help all the time&amp;quot;.&lt;/p&gt;\n\n&lt;p&gt;I love her and am trying to do my level best to be a supportive, helpful and understanding partner, but I really don&amp;#39;t want to turn into her full-time carer. She&amp;#39;s from overseas so her family aren&amp;#39;t around and her friends are too busy to help out. Has anyone been in a situation like this?&lt;/p&gt;\n\n&lt;p&gt;tldr Girlfriend sick, am doing almost everything for her. Wants me to move in and look after her. &lt;/p&gt;\n\n&lt;p&gt;edit 1: thanks for all the advice below. Funnily enough it was the people telling me to be mercenary and break up with her that were the most help, because I was all &amp;quot;well I&amp;#39;m not going to do THAT&amp;quot; which helped me decide to keep doing what I&amp;#39;m doing for a bit.&lt;/p&gt;\n\n&lt;p&gt;Also in slightly bigger news the disease isn&amp;#39;t so mysterious anymore. The results of a hip MRI came in and she&amp;#39;s got a lump on her pelvis. So... yeah :( We&amp;#39;ve got a doctors appointment tomorrow to find out what it is.&lt;/p&gt;\n\n&lt;p&gt;edit 2: first of all none of my post was talking about breaking up with her - just wanted advice on how to cope with  sick partner and not get too miserable myself buuuut&lt;/p&gt;\n\n&lt;p&gt;it&amp;#39;s all a moot point because the doctors appointment got brought forward and it&amp;#39;s a very large &amp;quot;bony destructive malignant tumour&amp;quot; in her hip that&amp;#39;s going to require immediate radio and surgery. So her family are flying her off to her home country at 7am tomorrow morning and have offered to fly me over v soon&lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "selftext": "At the start of the year my girlfriend [30F] had a sore knee. This has slowly progressed in severity until she \"feels like her legs are dying\" and now she's all but bedbound and can barely walk. She's seen multiple doctors, had MRI and X-Rays and nobody can work out what's wrong with her other than prescribing pain relief. Naturally, we're both terrified - we were running half marathons together this time last year.\n\nIt's obviously had a big hit on our relationship. We used to be out most nights of the week and busy socializing on weekends, now we spend most of our time in her bed watching Netflix. Even this is painful for her and most of the time she's grimacing, groaning and screaming in pain, which is really upsetting to see.\n\nIt's also really changed the dynamics of our relationship as she's now almost entirely reliant on me. I'm cleaning her flat, cooking for her, doing her laundry, shopping, assisting her in walking, taking her to clinics and hospitals and so on. Now she's suggested that I move in with her as she might need my help full time.\n\nI really love her, but this dependence is sucking the love out of our relationship and slowly grinding me down (any intimacy has dried up as she's so sensitive to pain I can't even cuddle her properly). The pain makes her snap at me, and I get frustrated and snap back at her. It's gotten to the pain where I'm HUGELY relieved when I get to leave her flat. Now she's talking about me moving in as \"I might need your help all the time\".\n\nI love her and am trying to do my level best to be a supportive, helpful and understanding partner, but I really don't want to turn into her full-time carer. She's from overseas so her family aren't around and her friends are too busy to help out. Has anyone been in a situation like this?\n\ntldr Girlfriend sick, am doing almost everything for her. Wants me to move in and look after her. \n\nedit 1: thanks for all the advice below. Funnily enough it was the people telling me to be mercenary and break up with her that were the most help, because I was all \"well I'm not going to do THAT\" which helped me decide to keep doing what I'm doing for a bit.\n\nAlso in slightly bigger news the disease isn't so mysterious anymore. The results of a hip MRI came in and she's got a lump on her pelvis. So... yeah :( We've got a doctors appointment tomorrow to find out what it is.\n\nedit 2: first of all none of my post was talking about breaking up with her - just wanted advice on how to cope with  sick partner and not get too miserable myself buuuut\n\nit's all a moot point because the doctors appointment got brought forward and it's a very large \"bony destructive malignant tumour\" in her hip that's going to require immediate radio and surgery. So her family are flying her off to her home country at 7am tomorrow morning and have offered to fly me over v soon",
                    "likes": null,
                    "suggested_sort": "confidence",
                    "user_reports": [],
                    "secure_media": null,
                    "link_flair_text": "Relationships",
                    "id": "69x56d",
                    "view_count": null,
                    "secure_media_embed": {},
                    "clicked": false,
                    "score": 617,
                    "report_reasons": null,
                    "author": "PenguinMask22",
                    "saved": false,
                    "mod_reports": [],
                    "name": "t3_69x56d",
                    "subreddit_name_prefixed": "r/relationships",
                    "approved_by": null,
                    "over_18": false,
                    "domain": "self.relationships",
                    "hidden": false,
                    "thumbnail": "",
                    "subreddit_id": "t5_2qjvn",
                    "edited": 1494268886.0,
                    "link_flair_css_class": "m-vt relationships",
                    "author_flair_css_class": null,
                    "gilded": 0,
                    "downs": 0,
                    "brand_safe": true,
                    "archived": false,
                    "removal_reason": null,
                    "can_gild": true,
                    "is_self": true,
                    "hide_score": false,
                    "spoiler": false,
                    "permalink": "/r/relationships/comments/69x56d/me_31m_with_my_girlfriend_28f_3_years_she_has/",
                    "num_reports": null,
                    "locked": false,
                    "stickied": false,
                    "created": 1494265879.0,
                    "url": "https://www.reddit.com/r/relationships/comments/69x56d/me_31m_with_my_girlfriend_28f_3_years_she_has/",
                    "author_flair_text": null,
                    "quarantine": false,
                    "title": "Me [31M] with my girlfriend [28F] 3 years. She has mysterious illness. I feel like I'm turning into her carer.",
                    "created_utc": 1494237079.0,
                    "distinguished": null,
                    "media": null,
                    "num_comments": 127,
                    "visited": false,
                    "subreddit_type": "public",
                    "ups": 617
                }
            },
            {
                "kind": "t3",
                "data": {
                    "contest_mode": false,
                    "banned_by": null,
                    "media_embed": {},
                    "subreddit": "relationships",
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;I&amp;#39;ve been working 11 hour days, 5 days a week for the past 3 months. I have severe anxiety and a panic disorder that I&amp;#39;ve been recovering from and knew when I entered the job I wasn&amp;#39;t ready but I needed the money. My family is SO proud of me and this makes this all the more hard. This job is literally killing me. I&amp;#39;m 48kg, I have panic attacks daily, I cry a lot, when I&amp;#39;m not at work I sleep to ease the exhaustion and have stopped seeing most of my friends. I stopped seeing my doctor because they don&amp;#39;t work on weekends and the ones that do are too expensive. &lt;/p&gt;\n\n&lt;p&gt;I know deep down that I think I need to quit this job. I thought maybe I could get a 3 day a week job that would support me and see a doctor once a week to fix my health. I know this will crush my family (and myself) because this was a huge opportunity and I was nailing the job itself. I was great at it. But in turn I&amp;#39;m losing myself entirely. I&amp;#39;m scared that leaving a job 3 months in will ruin my chances of getting another job. I&amp;#39;m scared that I will hate myself forever for leaving but at the same time it&amp;#39;s gotten to the point where I&amp;#39;m taking so many sick days off I&amp;#39;m likely going to be fired. &lt;/p&gt;\n\n&lt;p&gt;How best would I tackle this situation, with my boss and my family? Am I being weak? &lt;/p&gt;\n\n&lt;p&gt;TLDR - my job is killing me and I know deep down I need to quit but it&amp;#39;ll hurt my family so much. I&amp;#39;m scared to do so but my health is only depleting the longer I stay and I&amp;#39;m starting to take so many sick days I think I&amp;#39;ll be fired soon anyway. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "selftext": "I've been working 11 hour days, 5 days a week for the past 3 months. I have severe anxiety and a panic disorder that I've been recovering from and knew when I entered the job I wasn't ready but I needed the money. My family is SO proud of me and this makes this all the more hard. This job is literally killing me. I'm 48kg, I have panic attacks daily, I cry a lot, when I'm not at work I sleep to ease the exhaustion and have stopped seeing most of my friends. I stopped seeing my doctor because they don't work on weekends and the ones that do are too expensive. \n\nI know deep down that I think I need to quit this job. I thought maybe I could get a 3 day a week job that would support me and see a doctor once a week to fix my health. I know this will crush my family (and myself) because this was a huge opportunity and I was nailing the job itself. I was great at it. But in turn I'm losing myself entirely. I'm scared that leaving a job 3 months in will ruin my chances of getting another job. I'm scared that I will hate myself forever for leaving but at the same time it's gotten to the point where I'm taking so many sick days off I'm likely going to be fired. \n\nHow best would I tackle this situation, with my boss and my family? Am I being weak? \n\nTLDR - my job is killing me and I know deep down I need to quit but it'll hurt my family so much. I'm scared to do so but my health is only depleting the longer I stay and I'm starting to take so many sick days I think I'll be fired soon anyway. ",
                    "likes": null,
                    "suggested_sort": "confidence",
                    "user_reports": [],
                    "secure_media": null,
                    "link_flair_text": "Non-Romantic",
                    "id": "69x0p8",
                    "view_count": null,
                    "secure_media_embed": {},
                    "clicked": false,
                    "score": 327,
                    "report_reasons": null,
                    "author": "spiralized1987",
                    "saved": false,
                    "mod_reports": [],
                    "name": "t3_69x0p8",
                    "subreddit_name_prefixed": "r/relationships",
                    "approved_by": null,
                    "over_18": false,
                    "domain": "self.relationships",
                    "hidden": false,
                    "thumbnail": "",
                    "subreddit_id": "t5_2qjvn",
                    "edited": false,
                    "link_flair_css_class": "m-gn misc",
                    "author_flair_css_class": null,
                    "gilded": 0,
                    "downs": 0,
                    "brand_safe": true,
                    "archived": false,
                    "removal_reason": null,
                    "can_gild": true,
                    "is_self": true,
                    "hide_score": false,
                    "spoiler": false,
                    "permalink": "/r/relationships/comments/69x0p8/my_25f_job_is_literally_killing_me_but_i_dont/",
                    "num_reports": null,
                    "locked": false,
                    "stickied": false,
                    "created": 1494263707.0,
                    "url": "https://www.reddit.com/r/relationships/comments/69x0p8/my_25f_job_is_literally_killing_me_but_i_dont/",
                    "author_flair_text": null,
                    "quarantine": false,
                    "title": "My (25f) job is literally killing me but I don't know how to tell my family (or boss) that I need to quit.",
                    "created_utc": 1494234907.0,
                    "distinguished": null,
                    "media": null,
                    "num_comments": 115,
                    "visited": false,
                    "subreddit_type": "public",
                    "ups": 327
                }
            },
            {
                "kind": "t3",
                "data": {
                    "contest_mode": false,
                    "banned_by": null,
                    "media_embed": {},
                    "subreddit": "relationships",
                    "selftext_html": "&lt;!-- SC_OFF --&gt;&lt;div class=\"md\"&gt;&lt;p&gt;Me and husband were heroin addicts in our teen years, we both quit at 21, got married at 24, had our daughter that same year. Within a year, possibly from the stress, my husband relapsed. We both agreed it was a better idea for him to stay away from our family, even though I do love him to death, my daughter cannot grow up with a junkie father. &lt;/p&gt;\n\n&lt;p&gt;then he got better, around when she was 5 years old. He came back into her life and even though I was cautious, he stayed fine and clean for nearly 6 whole entire years and lived with us. Then we got divorced for other reasons, both of us were cheaters and there was no sexual love between either of us. When she was 14, he began using again. He lived only 10 blocks away from us so even though we were divorced we saw him very often. At first he hid his relapse from me, but eventually I knew. &lt;/p&gt;\n\n&lt;p&gt;I confronted him, and he admitted it, he had been using for the past 6 months. I wanted to fucking cry, I still loved him as a man even though we werent married anymore we were basically still the closest people to each other, this was going to be an issue for life for him, nearly 10 whole entire years clean and he still relapsed. We both agreed, he shouldnt see our daughter anymore, maybe briefly but he cant be her father like this, he has to keep some distance. &lt;/p&gt;\n\n&lt;p&gt;The past two months since that discussion have been hell. He wasn&amp;#39;t even there for her 15th birthday 3 weeks ago, I told him it was fine for him to come if he really wanted, and he said he was having withdrawal and couldnt. Our daughter hysterically cried her entire birthday. He REALLY, REALLY wants to keep his addiction a secret from our daughter, he stresses this so much, he doesnt want to be seen as a monster. But I cannot keep coming up with excuses as to why she cant go over. This lie that we have kept up is collapsing around us and our daughter is so suspicious of everything and everyone. He keeps on saying he will get clean soon, and then we wont have to lie anymore and she can be with him, but i... might not ever allow that, even if he gets clean, because he might just relapse again. &lt;/p&gt;\n\n&lt;p&gt;I am thinking of just telling our daughter, flat out. Your dad is a heroin addict, he has been for his entire life. I was too. He is probably shooting up right now. &lt;/p&gt;\n\n&lt;p&gt;But this obviously is such a reckless way of approaching a super delicate problem. She is a VERY emotional and sensitive girl, she has no idea the kind of way we grew up, I am not even sure if she fully understands what heroin is. To find out her dad is a heroin addict, and that I used to be? It would destroy her world. \nWhat do we do? I am pretty sure we will tell her... but how? How do we tell her? &lt;/p&gt;\n\n&lt;hr/&gt;\n\n&lt;p&gt;&lt;strong&gt;tl;dr&lt;/strong&gt;: We have kept from our daughter that her father is a heroin addict, now she is suspicious and asking questions and we dont know what to do. &lt;/p&gt;\n&lt;/div&gt;&lt;!-- SC_ON --&gt;",
                    "selftext": "Me and husband were heroin addicts in our teen years, we both quit at 21, got married at 24, had our daughter that same year. Within a year, possibly from the stress, my husband relapsed. We both agreed it was a better idea for him to stay away from our family, even though I do love him to death, my daughter cannot grow up with a junkie father. \n\nthen he got better, around when she was 5 years old. He came back into her life and even though I was cautious, he stayed fine and clean for nearly 6 whole entire years and lived with us. Then we got divorced for other reasons, both of us were cheaters and there was no sexual love between either of us. When she was 14, he began using again. He lived only 10 blocks away from us so even though we were divorced we saw him very often. At first he hid his relapse from me, but eventually I knew. \n\nI confronted him, and he admitted it, he had been using for the past 6 months. I wanted to fucking cry, I still loved him as a man even though we werent married anymore we were basically still the closest people to each other, this was going to be an issue for life for him, nearly 10 whole entire years clean and he still relapsed. We both agreed, he shouldnt see our daughter anymore, maybe briefly but he cant be her father like this, he has to keep some distance. \n \n\nThe past two months since that discussion have been hell. He wasn't even there for her 15th birthday 3 weeks ago, I told him it was fine for him to come if he really wanted, and he said he was having withdrawal and couldnt. Our daughter hysterically cried her entire birthday. He REALLY, REALLY wants to keep his addiction a secret from our daughter, he stresses this so much, he doesnt want to be seen as a monster. But I cannot keep coming up with excuses as to why she cant go over. This lie that we have kept up is collapsing around us and our daughter is so suspicious of everything and everyone. He keeps on saying he will get clean soon, and then we wont have to lie anymore and she can be with him, but i... might not ever allow that, even if he gets clean, because he might just relapse again. \n\nI am thinking of just telling our daughter, flat out. Your dad is a heroin addict, he has been for his entire life. I was too. He is probably shooting up right now. \n\nBut this obviously is such a reckless way of approaching a super delicate problem. She is a VERY emotional and sensitive girl, she has no idea the kind of way we grew up, I am not even sure if she fully understands what heroin is. To find out her dad is a heroin addict, and that I used to be? It would destroy her world. \nWhat do we do? I am pretty sure we will tell her... but how? How do we tell her? \n  ---   \n  **tl;dr**: We have kept from our daughter that her father is a heroin addict, now she is suspicious and asking questions and we dont know what to do. ",
                    "likes": null,
                    "suggested_sort": "confidence",
                    "user_reports": [],
                    "secure_media": null,
                    "link_flair_text": "Non-Romantic",
                    "id": "6a0syu",
                    "view_count": null,
                    "secure_media_embed": {},
                    "clicked": false,
                    "score": 37,
                    "report_reasons": null,
                    "author": "ayyleio",
                    "saved": false,
                    "mod_reports": [],
                    "name": "t3_6a0syu",
                    "subreddit_name_prefixed": "r/relationships",
                    "approved_by": null,
                    "over_18": false,
                    "domain": "self.relationships",
                    "hidden": false,
                    "thumbnail": "",
                    "subreddit_id": "t5_2qjvn",
                    "edited": false,
                    "link_flair_css_class": "m-gn misc",
                    "author_flair_css_class": null,
                    "gilded": 0,
                    "downs": 0,
                    "brand_safe": true,
                    "archived": false,
                    "removal_reason": null,
                    "can_gild": true,
                    "is_self": true,
                    "hide_score": false,
                    "spoiler": false,
                    "permalink": "/r/relationships/comments/6a0syu/me_39f_and_my_ex_husband_40m_have_kept_secret/",
                    "num_reports": null,
                    "locked": false,
                    "stickied": false,
                    "created": 1494305014.0,
                    "url": "https://www.reddit.com/r/relationships/comments/6a0syu/me_39f_and_my_ex_husband_40m_have_kept_secret/",
                    "author_flair_text": null,
                    "quarantine": false,
                    "title": "Me (39F) and my ex husband (40M) have kept secret that he is a heroin addict from our daughter (15F) for her entire life, and now that she is older the problem has become unavoidable. How do we proceed?",
                    "created_utc": 1494276214.0,
                    "distinguished": null,
                    "media": null,
                    "num_comments": 22,
                    "visited": false,
                    "subreddit_type": "public",
                    "ups": 37
                }
            }
        ],
        "after": "t3_6a0syu",
        "before": null
    }
}]